module.exports = {
  header: {
    t: "اسم البائع",
    d:
      "لوريم ايبسوم هو نموذج افتراضي يوضع في التصاميم لتعرض على العميل ليتصور طريقه وضع النصوص بالتصاميم سواء كانت تصاميم مطبوعه ... بروشور او فلاير على سبيل المثال ... او نماذج مواقع انترنت"
  },
  tabs: [
    "الرئيسية",
    "ملف الشركة",
    "المنتجات",
    "التصنيفات",
    "الاراء",
    "اتصل بنا"
  ],
  carousel: [
    {
      i: "1-1.jpg",
      t: "حقيبة جلدية",
      p: "€29.99",
      ty: "حقيبة رسول رمادي"
    },
    {
      i: "2-1.jpg",
      t: "حقيبة ظهر سوداء",
      p: "€23.49",
      ty: "حقيبة الظهر الكلية"
    },
    {
      i: "3-1.jpg",
      t: "حقيبة مكتب المرأة",
      p: "€11.99",
      ty: "حقيبة يد"
    },
    {
      i: "3-2.jpg",
      t: "حقيبة سوداء للرجال",
      p: "€39.00",
      ty: "حقيبة كمبيوتر محمول"
    },
    {
      i: "4-1.jpg",
      t: "سيدة حقيبة الكتف.",
      p: "€39.00",
      ty: "حقيبة كمبيوتر محمول"
    }
  ],
  contact: {
    name: ""
  }
};
