var fromHome = require("../home/home.ar");

function generateProducts() {
  let result = [];
  for (let index = 0; index < 15; index++) {
    result.push(fromHome.product);
    if (index % 2 == 0) {
      result[index] = {
        ...result[index],
        video: "assets/videos/oceans.mp4"
      };
    }
  }

  return result;
}

module.exports = {
  header: {
    t: "اسم البائع",
    d:
      "لوريم ايبسوم هو نموذج افتراضي يوضع في التصاميم لتعرض على العميل ليتصور طريقه وضع النصوص بالتصاميم سواء كانت تصاميم مطبوعه ... بروشور او فلاير على سبيل المثال ... او نماذج مواقع انترنت"
  },
  navs: [
    "الرئيسية",
    "ملف الشركة",
    "المنتجات",
    "التصنيفات",
    "الاراء",
    "اتصل بنا"
  ],
  carousel: [
    {
      i: "1-1.jpg",
      t: "حقيبة جلدية",
      p: "€29.99",
      ty: "حقيبة رسول رمادي"
    },
    {
      i: "2-1.jpg",
      t: "حقيبة ظهر سوداء",
      p: "€23.49",
      ty: "حقيبة الظهر الكلية"
    },
    {
      i: "3-1.jpg",
      t: "حقيبة مكتب المرأة",
      p: "€11.99",
      ty: "حقيبة يد"
    },
    {
      i: "3-2.jpg",
      t: "حقيبة سوداء للرجال",
      p: "€39.00",
      ty: "حقيبة كمبيوتر محمول"
    },
    {
      i: "4-1.jpg",
      t: "سيدة حقيبة الكتف.",
      p: "€39.00",
      ty: "حقيبة كمبيوتر محمول"
    }
  ],
  contact: {
    name: ""
  },
  tabs: [
    "ملف الشركة",
    "الإنتاج التجاري",
    "سياسات المعلومات",
    "معرض الصور",
    "شهادة تحققت"
  ],
  productsList: generateProducts(),
  feedbacks: [
    {
      n: "حسام سعيد",
      s: "1",
      d: "15/12/2012",
      f:
        "هناك حقيقة مثبتة منذ زمن طويل وهي أن المحتوى المقروء لصفحة ما سيلهي القارئ عن التركيز على الشكل الخارجي للنص أو شكل توضع الفقرات في الصفحة التي يقرأها. ولذلك يتم استخدام طريقة لوريم إيبسوم لأنها تعطي توزيعاَ طبيعياَ -إلى "
    },
    {
      n: "حسام اسماء",
      s: "3",
      d: "15/12/2012",
      f:
        "هناك حقيقة مثبتة منذ زمن طويل وهي أن المحتوى المقروء لصفحةاستخدام هنا يوجد محتوى نصي، هنا يوجد محتوى نصي فتجعلها تبدو (أي الأحرف) وكأنها نص مقروء. العديد من برامح النشر المكتبي"
    },
    {
      n: "أسعد",
      s: "2",
      d: "15/12/2012",
      f:
        "ل الخارجي للنص أو شكل توضع الفقرات في الصفحة التي يقرأها. ولذلك يتم استخدام طريقة لوريم إيبسوم لأنها تعطي توزيعاَ طبيعياَ -إلى حد ما- للأحرف عوضاً عن استخدام هنا يوجد محتوى نصي، هنا يوجد محتوى نصي فتجعلها تبدو (أي الأحرف) وكأنها نص مقروء. العديد من برامح النشر المكتبي"
    },
    {
      n: "أنغام أليكا",
      s: "5",
      d: "15/12/2012",
      f:
        "هناك حقيقة مثبتة منذ زمن طويل وهي أن المحتوى المقروء لصفحة ما سيلهي القارئ عن التركيز على الشكل الخارجي للنص أو شكل توضع الفقرات في الصفحة التي يقرأها. ولذلك يتم استخدام طريقة لوريم إيبسوم لأنها تعطي توزيعاَ طبيعياَ -إلى حد ما- للأحرف عوضاً عن استخدام هنا يوجد محتوى نصي، هنا يوجد محتوى نصي فتجعلها تبدو (أي الأحرف) وكأنها نص مقروء. العديد من برامح النشر المكتبي"
    },
    {
      n: "اسماء أليكا",
      s: "4",
      d: "15/12/2012",
      f:
        "هناك حقيقة مثبتة منذ زمن طويل و يتم استخدام طريقة لوريم إيبسوم لأنها تعطي توزيعاَ طبيعياَ -إلى حد ما- للأحرف عوضاً عن استخدام هنا يوجد محتوى نصي، هنا يوجد محتوى نصي فتجعلها تبدو (أي الأحرف) وكأنها نص مقروء. العديد من برامح النشر المكتبي"
    },
    {
      n: "سعيد أيات",
      s: "2",
      d: "15/12/2012",
      f:
        "هناك حقيقة مثبتة عن التركيز على الشكل لك يتم استخدام طريقة لوريم إيبسوم لأنها تعطي توزيعاَ طبيعياَ -إلى حد ما- للأحرف عوضاً عن استخدام هنا يوجد محتوى نصي، هنا يوجد محتوى نصي فتجعلها تبدو (أي الأحرف) وكأنها نص مقروء. العديد من برامح النشر المكتبي"
    }
  ]
};
