var categories = [
  {
    t: "الزراعة والغذاء",
    i: "1.png"
  },
  {
    t: "الملابس والمنسوجات وملحقاتها",
    i: "2.png"
  },
  {
    t: "السيارات والنقل",
    i: "Group 119.png"
  },
  {
    t: "حقائب وأحذية واكسسوارات",
    i: "bag.png"
  },
  {
    t: "المعدات الكهربائية والمكونات والاتصالات",
    i: "Fesha.png"
  },
  {
    t: "التعبئة والتغليف والإعلان ومكتب",
    i: "book.png"
  },
  {
    t: "إلكتروني",
    i: "Path 12.png"
  },
  {
    t: "المنزل ، الأنوار ومنشئ",
    i: "chair.png"
  },
  {
    t: "الصحة والجمال",
    i: "beauty.png"
  },
  {
    t: "الهدايا والرياضة والألعاب",
    i: "giftbox.png"
  },
  {
    t: "المعادن والكيماويات والمطاط والبلاستيك",
    i: "chemicalsvg.png"
  },
  {
    t: "الآلات وقطع الغيار الصناعية والأدوات",
    i: "machine.png"
  }
];

var links = [
  "فاصوليا",
  "مقهى",
  "النفايات الزراعية",
  "فاكهة",
  "السجائر العشبية السيجار",
  "تغذية",
  "المنتجات الزراعية الأخرى",
  "بذور النباتات والمصابيح",
  "المكسرات والحبات",
  "حبوب الفانيليا"
];

var categoryMap = [
  {
    t: "الزراعة والغذاء",
    i: "wheat.png",
    l: [
      {
        t: "الزراعة ",
        c: 32123,
        l: [...links, ...links]
      },
      {
        t: "طعام وشراب",
        c: 566448,
        l: [...links, ...links]
      }
    ]
  },
  {
    t: "الملابس والمنسوجات وملحقاتها",
    i: "Path 145.png",
    l: [
      {
        t: "ثياب",
        c: 32123,
        l: [...links, ...links]
      },
      {
        t: "منتجات النسيج والجلود ",
        c: 566448,
        l: [...links, ...links]
      },
      {
        t: "اكسسوارات أزياء",
        c: 2131,
        l: [...links, ...links]
      },
      {
        t: "الساعات ، مجوهرات ، نظارات ",
        c: 566448,
        l: [...links, ...links]
      }
    ]
  }
];

module.exports = {
  categories,
  links: categoryMap
};
